Revit 2024 API
DividedPath.SeparateReferencesIntoConnectedReferences Method
 This function separates the input curve references into groups of connected curve references. Each group of connected curve references can be used to create a divided path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static IList<IList<Reference>> SeparateReferencesIntoConnectedReferences(
	Document document,
	IList<Reference> curveReferences
)
Visual Basic
Public Shared Function SeparateReferencesIntoConnectedReferences ( _
	document As Document, _
	curveReferences As IList(Of Reference) _
) As IList(Of IList(Of Reference))
Visual C++
public:
static IList<IList<Reference^>^>^ SeparateReferencesIntoConnectedReferences(
	Document^ document,
	IList<Reference^>^ curveReferences
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
curveReferences
Type: System.Collections.Generic.IList<Reference>
 The references.
Return Value
 The grouped references
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Not all curve references in curveReferences represent a curve or an edge
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  this operation failed.
See Also
DividedPath Class
Autodesk.Revit.DB Namespace